Podkova/src/InformationRegisters/СостоянияКоммерческихПредложенийКлиентам/СостоянияКоммерческихПредложенийКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияКоммерческихПредложенийКлиентам</name>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>DefinedType.СостоянияКоммерческихПредложенийКлиенту</types>
    </type>
  </attributes>
  <dimensions>
    <name>КоммерческоеПредложениеКлиенту</name>
    <type>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/СостоянияКоммерческихПредложенийКлиентам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать состояние коммерческого предложения
//
// Параметры:
//  КоммерческоеПредложение - ОпределяемыйТип.КоммерческоеПредложениеКлиенту         - документ, состояние которого записывается,
//  Состояние               - ОпределяемыйТип.СостоянияКоммерческихПредложенийКлиенту - фиксируемое состояние документа.
//
Процедура ЗаписатьСостояние(КоммерческоеПредложение, Состояние) Экспорт
	
	Если Не ЗначениеЗаполнено(КоммерческоеПредложение) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СостоянияКоммерческихПредложенийКлиентам.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.КоммерческоеПредложениеКлиенту.Установить(КоммерческоеПредложение);
	
	Если ЗначениеЗаполнено(Состояние) Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.КоммерческоеПредложениеКлиенту = КоммерческоеПредложение;
		Запись.Состояние                      = Состояние;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
